In [8]:
import pandas as pd
import sqlite3

con = sqlite3.connect("cohort.db")

orders = pd.read_csv("fact_orders_2023_2025.csv")
customers = pd.read_csv("dim_customers_2023_2025.csv")
spend = pd.read_csv("fact_marketing_spend_daily_2023_2025.csv")

In [9]:
def eur_to_float(s):
    # "240,53 €" -> 240.53
    return (s.astype(str)
              .str.replace("€", "", regex=False)
              .str.replace(" ", "", regex=False)
              .str.replace(".", "", regex=False)   # tysiące
              .str.replace(",", ".", regex=False)  # przecinek na kropkę
              .astype(float))

orders["order_net_revenue"] = eur_to_float(orders["order_net_revenue"])

In [10]:

orders.to_sql("fact_orders", con, index=False, if_exists="replace")
customers.to_sql("dim_customers", con, index=False, if_exists="replace")
spend.to_sql("fact_marketing_spend_daily", con, index=False, if_exists="replace")

4384

In [12]:
pd.read_sql_query("SELECT * FROM fact_orders LIMIT 5;", con)

,order_id,order_date,customer_id,channel,order_net_revenue,items_count,units
0,32848,2024-05-20,1,Email,240.53,3,3
1,36888,2024-10-07,1,Affiliate,290.46,1,3
2,1,2025-06-11,1,Paid Social,231.21,2,3
3,24230,2024-04-26,2,Paid Social,22.59,2,2
4,35750,2024-09-01,2,Email,83.92,1,3

In [14]:
sql = """
WITH customer_rev AS (
  SELECT
    customer_id,
    COUNT(*) AS orders,
    SUM(order_net_revenue) AS revenue
  FROM fact_orders
  GROUP BY customer_id
),
ranked AS (
  SELECT
    customer_id,
    orders,
    revenue,
    ROW_NUMBER() OVER (ORDER BY revenue DESC) AS rn,
    COUNT(*) OVER () AS n_customers,
    SUM(revenue) OVER () AS total_revenue,
    SUM(revenue) OVER (
      ORDER BY revenue DESC
      ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS cum_revenue
  FROM customer_rev
)
SELECT
  MIN(rn) AS customers_needed_for_80pct_revenue,
  ROUND(100.0 * MIN(rn) / MAX(n_customers), 2) AS pct_of_customers
FROM ranked
WHERE 1.0 * cum_revenue / total_revenue >= 0.80;
"""
pd.read_sql_query(sql, con)

   customers_needed_for_80pct_revenue  pct_of_customers
0                                8798             48.88

In [16]:
sql = """
WITH customer_rev AS (
  SELECT
    customer_id,
    SUM(order_net_revenue) AS revenue
  FROM fact_orders
  GROUP BY customer_id
),
ranked AS (
  SELECT
    customer_id,
    revenue,
    ROW_NUMBER() OVER (ORDER BY revenue DESC) AS rn,
    COUNT(*)    OVER () AS n_customers,
    SUM(revenue) OVER () AS total_revenue
  FROM customer_rev
)
SELECT
  ROUND(
    100.0 * SUM(CASE WHEN rn <= CAST(n_customers * 0.01 + 0.999999 AS INT) THEN revenue ELSE 0 END)
    / MAX(total_revenue), 2
  ) AS top_1pct_revenue_share,
  ROUND(
    100.0 * SUM(CASE WHEN rn <= CAST(n_customers * 0.05 + 0.999999 AS INT) THEN revenue ELSE 0 END)
    / MAX(total_revenue), 2
  ) AS top_5pct_revenue_share,
  ROUND(
    100.0 * SUM(CASE WHEN rn <= CAST(n_customers * 0.10 + 0.999999 AS INT) THEN revenue ELSE 0 END)
    / MAX(total_revenue), 2
  ) AS top_10pct_revenue_share
FROM ranked;
"""
pd.read_sql_query(sql, con)

   top_1pct_revenue_share  top_5pct_revenue_share  top_10pct_revenue_share
0                     4.5                   17.15                    29.12

In [17]:
sql = """
WITH customer_rev AS (
  SELECT
    customer_id,
    COUNT(*) AS orders,
    SUM(order_net_revenue) AS revenue
  FROM fact_orders
  GROUP BY customer_id
),
ranked AS (
  SELECT
    customer_id,
    orders,
    revenue,
    ROW_NUMBER() OVER (ORDER BY revenue DESC) AS rn,
    SUM(revenue) OVER () AS total_revenue,
    SUM(revenue) OVER (
      ORDER BY revenue DESC
      ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS cum_revenue
  FROM customer_rev
)
SELECT
  rn AS vip_rank,
  customer_id,
  orders,
  ROUND(revenue, 2) AS revenue,
  ROUND(100.0 * revenue / total_revenue, 2) AS revenue_share_pct,
  ROUND(100.0 * cum_revenue / total_revenue, 2) AS cumulative_share_pct
FROM ranked
ORDER BY rn
LIMIT 20;
"""
pd.read_sql_query(sql, con)

,vip_rank,customer_id,orders,revenue,revenue_share_pct,cumulative_share_pct
0,1,1987,11,2870.96,0.04,0.04
1,2,12915,18,2861.05,0.04,0.07
2,3,12942,15,2860.94,0.04,0.11
3,4,10102,12,2835.46,0.04,0.15
4,5,5858,10,2721.90,0.03,0.18
5,6,7531,17,2671.56,0.03,0.21
6,7,9392,10,2551.26,0.03,0.25
7,8,14551,8,2531.85,0.03,0.28
8,9,8193,12,2528.20,0.03,0.31
9,10,15302,13,2502.84,0.03,0.34
10,11,7785,11,2496.91,0.03,0.38
11,12,15918,11,2486.75,0.03,0.41
12,13,14645,10,2479.32,0.03,0.44
13,14,8837,14,2352.56,0.03,0.47
14,15,4988,15,2337.36,0.03,0.50
15,16,8005,11,2327.77,0.03,0.53
16,17,4824,12,2310.29,0.03,0.56
17,18,12700,8,2278.09,0.03,0.59
18,19,9906,13,2277.01,0.03,0.62
19,20,1072,8,2256.23,0.03,0.65